[
  {
    "id": "1",
    "title": "See patients on Day 1",
    "desc": "Spend your first day working with standardized patients in the Sentara Center for Simulation and Immersive Learning.",
    "dropTitle": "See patients on Day 1",
    "dropDesc": "As national leaders in medical modeling and simulation, we provide you with early experience working with standardized patients and practicing with lifelike simulations.",
    "vidId": "VPLz5XvIu-M?si=0vxrbS-yHAsTxfRQ",
    "points": [
      "Score above the USMLE national mean.",
      "Are educated in a culture of service learning.",
      "Are trained in an integrated health system and a variety of hospitals."
    ]
  },
  {
    "id": "2",
    "title": "Early ultrasound training",
    "desc": "Use the field’s leading technologies in your first weeks with our robust ultrasound curriculum.",
    "dropTitle": "Early ultrasound training",
    "dropDesc": "As early adopters of ultrasound use in teaching, our ultrasound curriculum is ahead of the curve. From your first week, you will explore the technology that doctors are using on a daily basis across the country and around the world.",
    "vidId": "u90c4h0ELQw",
    "points": [
      "With ultrasound integrated in their curriculum from the first year, EVMS graduates know the principles and applications of ultrasound imaging inside out.",
      "Our faculty are nationally recognized for their early adoption of ultrasound into the medical curriculum. ",
      "Our students are prepared to use this technology as soon as they begin clinical rotations."
    ]
  },
  {
    "id": "3",
    "title": "Varied training environments",
    "desc": "Present and take an active role in rounds while working with diverse patient populations at several hospital locations.",
    "dropTitle": "Varied training environments",
    "dropDesc": "As a student at a medical school without its own hospital, you will have opportunities to train in a variety of hospitals — from a level 1 trauma center to a children's hospital to military and community hospitals — and more than 150 partnering clinical practices in our region. You are a valued member of a patient's healthcare team early on, and this experience pays off: Program directors praise our students' advanced abilities during clinical rotations.",
    "vidId": "_XxKMXTwO6E",
    "points": [
      "High expectations",
      "Early patient interaction",
      "Integrated health care team"
    ]
  }
]
